In [1]:
import pandas as pd

In [2]:
ipl_data = {'team' : ['Riders','Riders','Devils','Devils','Kings','kings','Kings','Kings','Riders','Royals','Royals','Riders'],
           'Rank':[1,2,2,3,3,4,1,1,2,4,1,2],
           'Year' :[2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
           'Points':[876,789,863,673,741,812,756,788,694,701,804,690]}

df = pd.DataFrame(ipl_data)
df

    Points  Rank  Year    team
0      876     1  2014  Riders
1      789     2  2015  Riders
2      863     2  2014  Devils
3      673     3  2015  Devils
4      741     3  2014   Kings
5      812     4  2015   kings
6      756     1  2016   Kings
7      788     1  2017   Kings
8      694     2  2016  Riders
9      701     4  2014  Royals
10     804     1  2015  Royals
11     690     2  2017  Riders

In [3]:
df.groupby("team")["Points"].sum()
#team column 기준으로 그룹을 만들고
#Points column 에 sum을 apply하라
#Output is Series Data

team
Devils    1536
Kings     2285
Riders    3049
Royals    1505
kings      812
Name: Points, dtype: int64

In [12]:
h_index = df.groupby(['team','Year'])['Points'].sum()
h_index

team    Year
Devils  2014    863
        2015    673
Kings   2014    741
        2016    756
        2017    788
Riders  2014    876
        2015    789
        2016    694
        2017    690
Royals  2014    701
        2015    804
kings   2015    812
Name: Points, dtype: int64

In [13]:
h_index.index

MultiIndex(levels=[['Devils', 'Kings', 'Riders', 'Royals', 'kings'], [2014, 2015, 2016, 2017]],
           labels=[[0, 0, 1, 1, 1, 2, 2, 2, 2, 3, 3, 4], [0, 1, 0, 2, 3, 0, 1, 2, 3, 0, 1, 1]],
           names=['team', 'Year'])

In [15]:
h_index['Devils':'Kings']

team    Year
Devils  2014    863
        2015    673
Kings   2014    741
        2016    756
        2017    788
Name: Points, dtype: int64

In [17]:
h_index.unstack().fillna(0)
# unstack은 매트릭스 형태로 값을 출력해주고
# .fillna(0)는 NaN값을 0으로 출력해준다.

Year     2014   2015   2016   2017
team
Devils  863.0  673.0    0.0    0.0
Kings   741.0    0.0  756.0  788.0
Riders  876.0  789.0  694.0  690.0
Royals  701.0  804.0    0.0    0.0
kings     0.0  812.0    0.0    0.0

In [9]:
h_index.swaplevel()
#index 계층 스왑

Year  team
2014  Devils    863
2015  Devils    673
2014  Kings     741
2016  Kings     756
2017  Kings     788
2014  Riders    876
2015  Riders    789
2016  Riders    694
2017  Riders    690
2014  Royals    701
2015  Royals    804
      kings     812
Name: Points, dtype: int64

In [11]:
h_index.swaplevel().sortlevel(0)
#h_index.swaplevel().sort_index(0) sortlevel은 deprecated 되었기 때문에
#sort_index()를 사용해야한다고 한다.

Year  team
2014  Devils    863
      Kings     741
      Riders    876
      Royals    701
2015  Devils    673
      Riders    789
      Royals    804
      kings     812
2016  Kings     756
      Riders    694
2017  Kings     788
      Riders    690
Name: Points, dtype: int64

In [18]:
h_index.sum(level=0)

team
Devils    1536
Kings     2285
Riders    3049
Royals    1505
kings      812
Name: Points, dtype: int64

In [19]:
h_index.sum(level=1)

Year
2014    3181
2015    3078
2016    1450
2017    1478
Name: Points, dtype: int64

In [23]:
grouped = df.groupby('team')
grouped

In [24]:
for data in grouped:
    print(data)
# 첫번째가 그룹된 key(string)값 뒤에 나머지 값들이 그룹된 value(DataFrame)값

('Devils',    Points  Rank  Year    team
2     863     2  2014  Devils
3     673     3  2015  Devils)
('Kings',    Points  Rank  Year   team
4     741     3  2014  Kings
6     756     1  2016  Kings
7     788     1  2017  Kings)
('Riders',     Points  Rank  Year    team
0      876     1  2014  Riders
1      789     2  2015  Riders
8      694     2  2016  Riders
11     690     2  2017  Riders)
('Royals',     Points  Rank  Year    team
9      701     4  2014  Royals
10     804     1  2015  Royals)
('kings',    Points  Rank  Year   team
5     812     4  2015  kings)

In [22]:
for name,group in grouped:
    print(name)
    print(group)

Devils
   Points  Rank  Year    team
2     863     2  2014  Devils
3     673     3  2015  Devils
Kings
   Points  Rank  Year   team
4     741     3  2014  Kings
6     756     1  2016  Kings
7     788     1  2017  Kings
Riders
    Points  Rank  Year    team
0      876     1  2014  Riders
1      789     2  2015  Riders
8      694     2  2016  Riders
11     690     2  2017  Riders
Royals
    Points  Rank  Year    team
9      701     4  2014  Royals
10     804     1  2015  Royals
kings
   Points  Rank  Year   team
5     812     4  2015  kings

In [25]:
grouped.get_group('Devils')

   Points  Rank  Year    team
2     863     2  2014  Devils
3     673     3  2015  Devils

In [26]:
grouped.agg(sum)
# 하나의 함수 적용 max, min 도 가능

        Points  Rank  Year
team
Devils    1536     5  4029
Kings     2285     5  6047
Riders    3049     7  8062
Royals    1505     5  4029
kings      812     4  2015

In [28]:
import numpy as np
grouped.agg(np.mean)
# numpy의 함수 적용

            Points      Rank         Year
team
Devils  768.000000  2.500000  2014.500000
Kings   761.666667  1.666667  2015.666667
Riders  762.250000  1.750000  2015.500000
Royals  752.500000  2.500000  2014.500000
kings   812.000000  4.000000  2015.000000

In [29]:
grouped['Points'].agg([np.sum,np.mean,np.std])
#특정 컬럼 Points에 3개의 numpy함수 적용
#다수의 함수를 적용할 때는 함수를 List 형태로 넘긴다.
#NaN 값은 .fillna(0)로 처리!

         sum        mean         std
team
Devils  1536  768.000000  134.350288
Kings   2285  761.666667   24.006943
Riders  3049  762.250000   88.567771
Royals  1505  752.500000   72.831998
kings    812  812.000000         NaN

Transformation

In [30]:
score = lambda x : (x - x.mean()) / x.std()
grouped.transform(score)
#grouped 내의 값을 정규화 시켜준다.
#적용되는 x.mean과 x.std의 범위는 당연히 그룹된 그룹별로 apply된다.

      Points      Rank      Year
0   1.284327 -1.500000 -1.161895
1   0.302029  0.500000 -0.387298
2   0.707107 -0.707107 -0.707107
3  -0.707107  0.707107  0.707107
4  -0.860862  1.154701 -1.091089
5        NaN       NaN       NaN
6  -0.236043 -0.577350  0.218218
7   1.096905 -0.577350  0.872872
8  -0.770596  0.500000  0.387298
9  -0.707107  0.707107 -0.707107
10  0.707107 -0.707107  0.707107
11 -0.815759  0.500000  1.161895

In [31]:
df.groupby('team').filter(lambda x: len(x) >=3)
#team으로 grouping 하고 filter조건인 길이가 3이상인 것으로 거른다.
#numpy의 boolean index와 매우 유사하다.

    Points  Rank  Year    team
0      876     1  2014  Riders
1      789     2  2015  Riders
4      741     3  2014   Kings
6      756     1  2016   Kings
7      788     1  2017   Kings
8      694     2  2016  Riders
11     690     2  2017  Riders

In [32]:
df.groupby('team').filter(lambda x: x['Points'].sum() > 1000)
#team으로 grouping하고 filter 조건인 Points의 총합이 1000보다 클경우 인 것으로 거른다.

    Points  Rank  Year    team
0      876     1  2014  Riders
1      789     2  2015  Riders
2      863     2  2014  Devils
3      673     3  2015  Devils
4      741     3  2014   Kings
6      756     1  2016   Kings
7      788     1  2017   Kings
8      694     2  2016  Riders
9      701     4  2014  Royals
10     804     1  2015  Royals
11     690     2  2017  Riders